temp/subscription-load-test.stage.yml
../bin/serverless-artillery invoke -p subscription-load-test.stage.yml

config:
  target: "https://stage.identity.q4inc.com"
  ensure:
    max: 10000 # fail if max response time exceeds 5000ms
    maxErrorRate: 4 # fail if error rate exceeds 0%
  phases:
    - duration: 300 # 5 min
      arrivalRate: 4 # 4 users per second ~ 200 per minute
      rampTo: 6 #range of users per second
      name: "Q4 IDP Login Load Test 300-166->333-228179506-all"
scenarios:
  - name: "Perform Q4 IDP Login http journey to console"
    flow:
      - get:
          url: "/oauth/auth?client_id=q4-platform-client&redirect_uri=https%3A%2F%2Fconnect.stage.q4inc.com%2F%3Flogin%3Dv2&response_type=code&scope=openid+profile+email&state=a09165adb16b42bfa4d3e786b4707471&code_challenge=lrJQeB1DNaqAY8gz6GEUXjes3abSXadPldpJIx99-UU&code_challenge_method=S256&resource=https%3A%2F%2Fconnect.stage.q4inc.com&prompt=none&audience=q4-platform-stage.api"
      - think: 2
      - get:
          url: "https://stage.identity.q4inc.com/interaction/p6bx6oADiDuak8wUk3xFl"
          headers:
            Cookie: "_session=YkxVQh-_wtQEdVpts9Ycd; _session.sig=sODmI0lXsqdFFuOtmfCXPoXae1E; _session.legacy=YkxVQh-_wtQEdVpts9Ycd; _session.legacy.sig=HqGDQzDLuA666bO9e5YyEHAV0BY; ph_phc_HbLYxTk2RzseT4Rtq5M7GlqJljQBmkGpPvn55E4Tzgg_posthog=%7B%22distinct_id%22%3A%22automation%2Bcorpuser-user%40q4inc.com%22%2C%22%24sesid%22%3A%5B1728053826279%2C%2201925807-d379-7d5b-9306-7a355c53974c%22%2C1728053760889%5D%2C%22%24epp%22%3Atrue%7D; ph_phc_RYBLIIva1eXxdrkqMwz0mxAGQEHcDd8iKOPJzUkgIX7_posthog=%7B%22distinct_id%22%3A%22automation%2Bcorpuser-user%40q4inc.com%22%2C%22%24sesid%22%3A%5B1728053898908%2C%22019257fb-cd67-7a5b-81fd-93d4ae731145%22%2C1728052972903%5D%2C%22%24epp%22%3Atrue%7D"
      - post:
          url: "https://stage.identity.q4inc.com/interaction/p6bx6oADiDuak8wUk3xFl/login"
          headers:
            Cookie: "_session=YkxVQh-_wtQEdVpts9Ycd; _session.sig=sODmI0lXsqdFFuOtmfCXPoXae1E; _session.legacy=YkxVQh-_wtQEdVpts9Ycd; _session.legacy.sig=HqGDQzDLuA666bO9e5YyEHAV0BY; ph_phc_HbLYxTk2RzseT4Rtq5M7GlqJljQBmkGpPvn55E4Tzgg_posthog=%7B%22distinct_id%22%3A%22automation%2Bcorpuser-user%40q4inc.com%22%2C%22%24sesid%22%3A%5B1728053826279%2C%2201925807-d379-7d5b-9306-7a355c53974c%22%2C1728053760889%5D%2C%22%24epp%22%3Atrue%7D; ph_phc_RYBLIIva1eXxdrkqMwz0mxAGQEHcDd8iKOPJzUkgIX7_posthog=%7B%22distinct_id%22%3A%22automation%2Bcorpuser-user%40q4inc.com%22%2C%22%24sesid%22%3A%5B1728053898908%2C%22019257fb-cd67-7a5b-81fd-93d4ae731145%22%2C1728052972903%5D%2C%22%24epp%22%3Atrue%7D"
          json:
            username: "automation+corpuser-user@q4inc.com"
            password: "C]83HZ=,r)0=U2l23m.J"
            isRememberUsername: false
            q4IdpClientId: "q4-platform-client"
      # Password Reset Request
      - post:
          url: "https://stage.identity.q4inc.com/password/password-reset"
          json:
            email: "maryam.babalola+101@q4inc.com"
            q4IdpClientId: "q4-platform-client"
      # Setting Password
      - get:
          url: "https://stage.identity.q4inc.com/oauth/auth?response_type=code&client_id=q4-platform-client&redirect_uri=https://connect.stage.q4inc.com/?login=v2&prompt=resetPassword&userCode=9e4382c9-4e81-45f3-82cb-8395aea4ab64&resource=https://connect.stage.q4inc.com"
      - think: 2
      - get:
          url: "https://stage.identity.q4inc.com/interaction/b0Z7DJG8TuMwvmS2Nuazw"
          headers:
            Cookie: "_interaction=b0Z7DJG8TuMwvmS2Nuazw; _interaction.sig=WqAJ9_4F4a0Y34J5dIWzvdWQ02k; _interaction.legacy=b0Z7DJG8TuMwvmS2Nuazw; _interaction.legacy.sig=KGor6ygtzYCDcTu3yyoDi3CcpkI; ph_phc_HbLYxTk2RzseT4Rtq5M7GlqJljQBmkGpPvn55E4Tzgg_posthog=%7B%22distinct_id%22%3A%22maryam.babalola%2B101%40q4inc.com%22%2C%22%24sesid%22%3A%5B1727809591103%2C%2201924978-7eaa-7271-8e0a-6e16b47dfe56%22%2C1727809486506%5D%2C%22%24epp%22%3Atrue%7D"
      - post:
          url: "https://stage.identity.q4inc.com/interaction/b0Z7DJG8TuMwvmS2Nuazw/setpassword"
          headers:
            Cookie: "_interaction=b0Z7DJG8TuMwvmS2Nuazw; _interaction.sig=WqAJ9_4F4a0Y34J5dIWzvdWQ02k; _interaction.legacy=b0Z7DJG8TuMwvmS2Nuazw; _interaction.legacy.sig=KGor6ygtzYCDcTu3yyoDi3CcpkI; ph_phc_HbLYxTk2RzseT4Rtq5M7GlqJljQBmkGpPvn55E4Tzgg_posthog=%7B%22distinct_id%22%3A%22maryam.babalola%2B101%40q4inc.com%22%2C%22%24sesid%22%3A%5B1727809591103%2C%2201924978-7eaa-7271-8e0a-6e16b47dfe56%22%2C1727809486506%5D%2C%22%24epp%22%3Atrue%7D"
      # JWKS
      - get:
          url: "https://stage.identity.q4inc.com/oauth/jwks"